Catalogs/ВидыПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчитываемыеПараметрыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыОпределенияСтоимостиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСтоимостиПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПараметрам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШаблону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыПродукции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбластьПеременные

&НаКлиенте
Перем мПараметрПродукции;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мНаименование = Объект.Наименование;
	мПрефикс = Объект.Префикс;
	
	//Элементы.УникальнаяПродукция.Доступность = Ложь; // до полной обкатки функционала 
	
	ПроверитьСпособОпределенияСтоимости();
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.УникальнаяПродукция Тогда
		Объект.УчитываемыеПараметрыПродукции.Очистить();	
	Иначе
	    Объект.Префикс = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ВидыПродукции", , Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда		
		Если НЕ ЗначениеЗаполнено(Объект.Префикс) Тогда
			Объект.Префикс = Объект.Наименование;	
		ИначеЕсли мПрефикс = мНаименование Тогда
			Объект.Префикс = Объект.Наименование;	
		КонецЕсли;
	Иначе			
		Если мПрефикс = мНаименование Тогда
			Объект.Префикс = Объект.Наименование;	
		КонецЕсли	
	КонецЕсли;
	
	мНаименование = Объект.Наименование;
	мПрефикс = Объект.Префикс;
		
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксПриИзменении(Элемент)
	
	мНаименование = Объект.Наименование;
	мПрефикс = Объект.Префикс;
	
КонецПроцедуры

&НаКлиенте
Процедура УникальнаяПродукцияПриИзменении(Элемент)
	
	ПроверитьСпособОпределенияСтоимости();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура УчитываемыеПараметрыПродукцииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УчитываемыеПараметрыПродукции.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ мПараметрПродукции = ТекущиеДанные.ПараметрПродукции Тогда
		
		МассивСсылок = НайтиИспользованиеПараметраПродукции(Объект.Ссылка, мПараметрПродукции);
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Событие", "Изменение");
		ДополнительныеПараметры.Вставить("ПараметрПродукции", мПараметрПродукции);
		ДополнительныеПараметры.Вставить("МассивСсылок", МассивСсылок);
		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.УчитываемыеПараметрыПродукции.ТекущаяСтрока);
	
		ПоказатьВопросПодтвержденияУдаленияИзмененияПараметраПродукции(ДополнительныеПараметры);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитываемыеПараметрыПродукцииПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.УчитываемыеПараметрыПродукции.ТекущиеДанные;
	мПараметрПродукции = ТекущиеДанные.ПараметрПродукции;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитываемыеПараметрыПродукцииПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.УчитываемыеПараметрыПродукции.ТекущиеДанные;
	ПараметрПродукцииКУдалению = ТекущиеДанные.ПараметрПродукции;
	Если НЕ ЗначениеЗаполнено(ПараметрПродукцииКУдалению) Тогда
		Возврат;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	МассивСсылок = НайтиИспользованиеПараметраПродукции(Объект.Ссылка, ПараметрПродукцииКУдалению);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Событие", "Удаление");
	ДополнительныеПараметры.Вставить("ПараметрПродукции", ПараметрПродукцииКУдалению);
	ДополнительныеПараметры.Вставить("МассивСсылок", МассивСсылок);
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.УчитываемыеПараметрыПродукции.ТекущаяСтрока);

	Если МассивСсылок.Количество() = 0 Тогда
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеУдаленияПараметраПродукции", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = СтрШаблон("Удалить параметр ""%1""?", ДополнительныеПараметры.ПараметрПродукции);
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, "Удалить");
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, "Отмена");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиВопроса, , КодВозвратаДиалога.Нет);
		
	Иначе		
		Отказ = Истина;	
		ПоказатьВопросПодтвержденияУдаленияИзмененияПараметраПродукции(ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПодтвержденияУдаленияИзмененияПараметраПродукции(ДополнительныеПараметры)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеУдаленияИзмененияПараметраПродукции", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = СтрШаблон("ВНИМАНИЕ! %1 параметр ""%2"" используется в %3 карточках номенклатуры. 
							|Удалить данный параметр из вида продукции и всех карточек номенклатуры без возможности восстановления?", 
	                        ?(ДополнительныеПараметры.Событие = "Удаление", "Удаляемый", "Измененный"),
							ДополнительныеПараметры.ПараметрПродукции,
							ДополнительныеПараметры.МассивСсылок.Количество());
							
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, "Удалить");
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, "Отмена");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиВопроса, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеУдаленияИзмененияПараметраПродукции(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если УдалитьПараметрПродукцииВНоменклатуре(ДополнительныеПараметры.МассивСсылок, ДополнительныеПараметры.ПараметрПродукции) Тогда
			
			Если ДополнительныеПараметры.Событие = "Удаление" Тогда
				ТекущаяСтрока = Объект.УчитываемыеПараметрыПродукции.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
				Объект.УчитываемыеПараметрыПродукции.Удалить(ТекущаяСтрока);
				Записать();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда	
		Если ДополнительныеПараметры.Событие = "Изменение" Тогда
			ТекущаяСтрока = Объект.УчитываемыеПараметрыПродукции.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
			ТекущаяСтрока.ПараметрПродукции = ДополнительныеПараметры.ПараметрПродукции;
			Записать();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеУдаленияПараметраПродукции(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущаяСтрока = Объект.УчитываемыеПараметрыПродукции.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		Объект.УчитываемыеПараметрыПродукции.Удалить(ТекущаяСтрока);
		
		Модифицированность = Истина;
		//Записать();			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере                                     
Процедура ПроверитьСпособОпределенияСтоимости()
	
	Элементы.СпособОпределенияСтоимости.СписокВыбора.Очистить();
	
	Если Объект.УникальнаяПродукция Тогда
		Элементы.СпособОпределенияСтоимости.СписокВыбора.Добавить(Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону);	
	Иначе
		Элементы.СпособОпределенияСтоимости.СписокВыбора.Добавить(Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре);
		Элементы.СпособОпределенияСтоимости.СписокВыбора.Добавить(Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СпособОпределенияСтоимости) Тогда
		Если Элементы.СпособОпределенияСтоимости.СписокВыбора.НайтиПоЗначению(Объект.СпособОпределенияСтоимости) = Неопределено Тогда
			ЗначениеПоУмолчанию = Элементы.СпособОпределенияСтоимости.СписокВыбора[0].Значение;
			Если НЕ Объект.СпособОпределенияСтоимости = ЗначениеПоУмолчанию Тогда
				Объект.СпособОпределенияСтоимости = ЗначениеПоУмолчанию ;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе	
		Объект.СпособОпределенияСтоимости = Элементы.СпособОпределенияСтоимости.СписокВыбора[0].Значение;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.Префикс.Видимость = Объект.УникальнаяПродукция;
	Элементы.ГруппаНоменклатуры.Видимость = Объект.УникальнаяПродукция;
	Элементы.ГруппаПараметрыПродукции.Видимость = НЕ Объект.УникальнаяПродукция;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиИспользованиеПараметраПродукции(ВидПродукции, ПараметрПродукции)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура.ПараметрыПродукции КАК НоменклатураПараметрыПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = НоменклатураПараметрыПродукции.Ссылка)
	|ГДЕ
	|	НоменклатураПараметрыПродукции.ПараметрПродукции = &ПараметрПродукции
	|	И СправочникНоменклатура.ВидПродукции = &ВидПродукции";
	
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	Запрос.УстановитьПараметр("ПараметрПродукции", ПараметрПродукции);
	
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьПараметрПродукцииВНоменклатуре(МассивСсылок, ПараметрПродукции)
	
	РезультатОбработки = Истина;
	
	НачатьТранзакцию();
	
	Для каждого СпрСсылка из МассивСсылок Цикл
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
		НСтрока = СпрОбъект.ПараметрыПродукции.Найти(ПараметрПродукции, "ПараметрПродукции");
		Если НЕ НСтрока = Неопределено Тогда
			СпрОбъект.ПараметрыПродукции.Удалить(НСтрока);
		КонецЕсли;
		Попытка
			СпрОбъект.Записать();
		Исключение
			РезультатОбработки = Ложь;
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
	Если РезультатОбработки Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти
